In [7]:
import pandas as pd
import numpy as np

In [100]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [101]:
dummy=pd.Series(df['FlightNumber'])

In [102]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [103]:
t=dummy.isnull()

In [104]:
for i in range(len(dummy)):
    if t[i]:
        dummy[i]=dummy[i-1]+10

In [105]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [106]:
df.drop(["FlightNumber"],axis=1)

            From_To  RecentDelays              Airline
0      LoNDon_paris      [23, 47]               KLM(!)
1      MAdrid_miLAN            []    <Air France> (12)
2  londON_StockhOlm  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          [13]       12. Air France
4   Brussels_londOn      [67, 32]          "Swiss Air"

In [107]:
df["FlightNumber"]=dummy

In [108]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [110]:
df["from_to1"]=df['From_To']

In [111]:
df

,From_To,FlightNumber,RecentDelays,Airline,from_to1
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon_paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),MAdrid_miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON_StockhOlm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest_PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels_londOn

In [112]:
From=pd.Series(df['From_To'])

In [113]:
From

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [114]:
df

,From_To,FlightNumber,RecentDelays,Airline,from_to1
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon_paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),MAdrid_miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON_StockhOlm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest_PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels_londOn

In [115]:
From

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [116]:
To=pd.Series(df['from_to1'])

In [117]:
To

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: from_to1, dtype: object

In [118]:
for i in range(len(From)):
    string=From[i].split("_")
    From[i]=string[0]
    print(From[i])
    print(string)

LoNDon
['LoNDon', 'paris']
MAdrid
['MAdrid', 'miLAN']
londON
['londON', 'StockhOlm']
Budapest
['Budapest', 'PaRis']
Brussels
['Brussels', 'londOn']

    From_To  FlightNumber  RecentDelays              Airline
0    LoNDon       10045.0      [23, 47]               KLM(!)
1    MAdrid       10055.0            []    <Air France> (12)
2    londON       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest       10075.0          [13]       12. Air France
4  Brussels       10085.0      [67, 32]          "Swiss Air"

In [119]:
To

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: from_to1, dtype: object

In [27]:
To

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: From_To, dtype: object

In [120]:
for i in range(len(To)):
    string=To[i].split("_")
    To[i]=string[1]
    print(string)

['LoNDon', 'paris']
['MAdrid', 'miLAN']
['londON', 'StockhOlm']
['Budapest', 'PaRis']
['Brussels', 'londOn']

In [121]:
To

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: from_to1, dtype: object

In [122]:
From

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: From_To, dtype: object

In [125]:
df["From"]=From

In [126]:
df["To"]=To

In [127]:
df

,From_To,FlightNumber,RecentDelays,Airline,from_to1,From,To
0,LoNDon,10045.0,"[23, 47]",KLM(!),paris,LoNDon,paris
1,MAdrid,10055.0,[],<Air France> (12),miLAN,MAdrid,miLAN
2,londON,10065.0,"[24, 43, 87]",(British Airways. ),StockhOlm,londON,StockhOlm
3,Budapest,10075.0,[13],12. Air France,PaRis,Budapest,PaRis
4,Brussels,10085.0,"[67, 32]","""Swiss Air""",londOn,Brussels,londOn

In [205]:
From

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: From_To, dtype: object

In [206]:
To

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: From_To, dtype: object

In [129]:
df1=df

In [130]:
df1

,From_To,FlightNumber,RecentDelays,Airline,from_to1,From,To
0,LoNDon,10045.0,"[23, 47]",KLM(!),paris,LoNDon,paris
1,MAdrid,10055.0,[],<Air France> (12),miLAN,MAdrid,miLAN
2,londON,10065.0,"[24, 43, 87]",(British Airways. ),StockhOlm,londON,StockhOlm
3,Budapest,10075.0,[13],12. Air France,PaRis,Budapest,PaRis
4,Brussels,10085.0,"[67, 32]","""Swiss Air""",londOn,Brussels,londOn

In [132]:
df1.drop(['From_To','FlightNumber'],axis=1)

   RecentDelays              Airline   from_to1      From         To
0      [23, 47]               KLM(!)      paris    LoNDon      paris
1            []    <Air France> (12)      miLAN    MAdrid      miLAN
2  [24, 43, 87]  (British Airways. )  StockhOlm    londON  StockhOlm
3          [13]       12. Air France      PaRis  Budapest      PaRis
4      [67, 32]          "Swiss Air"     londOn  Brussels     londOn

In [209]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,miLAN,NaN,[],<Air France> (12),MAdrid,miLAN
2,StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,PaRis,NaN,[13],12. Air France,Budapest,PaRis
4,londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [133]:
From=From.str.title()

In [134]:
From

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From_To, dtype: object

In [135]:
To=To.str.title()

In [136]:
To

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: from_to1, dtype: object

In [137]:
df1["From"]=From

In [138]:
df1["To"]=To

In [143]:
df1.drop(['From_To','FlightNumber'],axis=1,inplace=True)

In [144]:
df1

   RecentDelays              Airline   from_to1      From         To
0      [23, 47]               KLM(!)      paris    London      Paris
1            []    <Air France> (12)      miLAN    Madrid      Milan
2  [24, 43, 87]  (British Airways. )  StockhOlm    London  Stockholm
3          [13]       12. Air France      PaRis  Budapest      Paris
4      [67, 32]          "Swiss Air"     londOn  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [229]:
df1.drop(["From_To"],axis=1)

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [146]:
df1

   RecentDelays              Airline   from_to1      From         To
0      [23, 47]               KLM(!)      paris    London      Paris
1            []    <Air France> (12)      miLAN    Madrid      Milan
2  [24, 43, 87]  (British Airways. )  StockhOlm    London  Stockholm
3          [13]       12. Air France      PaRis  Budapest      Paris
4      [67, 32]          "Swiss Air"     londOn  Brussels     London

In [151]:
delays=df['RecentDelays'].apply(pd.Series)

In [157]:
delays.columns=['delay_{}'.format(n) for n in range(1,len(delays.columns)+1)]

In [160]:
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [161]:
df

,Airline,from_to1,From,To,delay_1,delay_2,delay_3
0,KLM(!),paris,London,Paris,23.0,47.0,NaN
1,<Air France> (12),miLAN,Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),StockhOlm,London,Stockholm,24.0,43.0,87.0
3,12. Air France,PaRis,Budapest,Paris,13.0,NaN,NaN
4,"""Swiss Air""",londOn,Brussels,London,67.0,32.0,NaN